In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
dic = {1:'Arwa',2:'Razan',3:'Rana'}
newSeries = pd.Series(dic)
newSeries

1     Arwa
2    Razan
3     Rana
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
newSeries.index = [11,12,13]
newSeries

11     Arwa
12    Razan
13     Rana
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
newSeries[:2]

11     Arwa
12    Razan
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [5]:
dic = pd.Series({14:'Rawan',15:'Rana',16:'Razan'})
newSeries.append(dic)

/var/folders/d4/ykbcmrzx06j9vf9qdfpgwzc00000gn/T/ipykernel_45716/584293557.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  newSeries.append(dic)

11     Arwa
12    Razan
13     Rana
14    Rawan
15     Rana
16    Razan
dtype: object

In [6]:
newSeries.drop_duplicates()

11     Arwa
12    Razan
13     Rana
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [7]:
dic = {
     'ID':[11,12,13,14],
     'Name':['Arwa','Razan','Rana','Rawan'],
     'GPA':[4.94,4.50,5,3.75]
 }
df = pd.DataFrame(dic)
df

   ID   Name   GPA
0  11   Arwa  4.94
1  12  Razan  4.50
2  13   Rana  5.00
3  14  Rawan  3.75

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [8]:
df2 = pd.read_csv('educ_figdp_1_Data.csv')
df2.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [9]:
df2.loc[1:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e

In [10]:
df2[1:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e